### Load relevant packages

In [213]:
import pandas as pd
import random
from datetime import datetime, timedelta, date

In [3]:
from sqlalchemy import create_engine, text
import psycopg2

### Create Schema in PostgreSQL

In [4]:
import psycopg2
import os

# Connect to PostgreSQL database
print('Successfully connected to the database.')
conn = psycopg2.connect(
    host="localhost",
    port='5432',
    dbname="5310final_project3",
    user="postgres",
    password="123")

Successfully connected to the database.

In [ ]:
##First create schema in PostgreSQL

conn_url = 'postgresql://postgres:123@localhost/5310final_project'
engine = create_engine(conn_url)
connection = engine.connect()
stmt = '''

-- Client information table
CREATE TABLE client (
    client_id INT PRIMARY KEY,
    Name VARCHAR(255) NOT NULL,
    Email VARCHAR(255),
    Phone_Number VARCHAR(100),
    Client_Type VARCHAR(20),  -- 'Buyer', 'Seller', 'Renter'
    Preferred_Home_Type VARCHAR(50),
    Preferred_Number_of_Bedrooms INT,
    Preferred_Number_of_Bathrooms INT,
    Preferred_Square_Footage INT,
    Preferred_School_Rating INT,
    date DATE
);

-- Employee information table, including agents and support staff
CREATE TABLE employee (
    employee_id INT PRIMARY KEY,
    Full_Name VARCHAR(50) NOT NULL,
    Email VARCHAR(50),
    Date_of_Hire DATE,
    Base_Salary DECIMAL(15, 2)
);

-- Office information table
CREATE TABLE office (
    office_id INT PRIMARY KEY,
    Office_Name VARCHAR(50),
    Address VARCHAR(100),
    State VARCHAR(20),
    City VARCHAR(50)
);

-- Office expenses information table
CREATE TABLE expenses (
    expense_id INT PRIMARY KEY,
    office_id INT,
    Date DATE,
    Expense_Type VARCHAR(50),
    Amount DECIMAL(15,2),
    FOREIGN KEY (office_id) REFERENCES office(office_id)
);

-- Property information table
CREATE TABLE property (
    property_id INT PRIMARY KEY,
    Listing_Type VARCHAR(50),
    Listing_Date DATE,
    Title VARCHAR(100),
    Street VARCHAR(100),
    City VARCHAR(50),
    Zip_Code CHAR(10),
    Bedrooms INT,
    Bathrooms INT,
    Square_Footage INT,
    Year_Built INT,
    Listed_Price DECIMAL(15, 2),
    Owner_Seller_Name VARCHAR(50),
    Description TEXT
);

-- Transaction information table
CREATE TABLE transaction (
    transaction_id INT PRIMARY KEY,
    property_id INT,
    client_id INT,
    employee_id INT,
    Date_of_Transaction DATE,
    Status VARCHAR(50),
    Final_Price DECIMAL(15, 2),
    Agent_Fee_Percentage DECIMAL(5, 2),
    FOREIGN KEY (property_id) REFERENCES property(property_id),
    FOREIGN KEY (employee_id) REFERENCES employee(employee_id)
);

-- Property features information table
CREATE TABLE property_features (
    feature_id INT PRIMARY KEY,
    feature_name VARCHAR(100)
);

-- Property feature link table
CREATE TABLE property_feature_link (
    property_id INT,
    feature_id INT,
    PRIMARY KEY (property_id, feature_id),
    FOREIGN KEY (property_id) REFERENCES property(property_id),
    FOREIGN KEY (feature_id) REFERENCES property_features(feature_id)
);

-- Client management information table
CREATE TABLE client_management (
    client_id INT,
    assigned_employee_id INT,
    PRIMARY KEY (client_id, assigned_employee_id),
    FOREIGN KEY (client_id) REFERENCES client(client_id),
    FOREIGN KEY (assigned_employee_id) REFERENCES employee(employee_id)
);

-- Schools table
CREATE TABLE schools (
    school_id INT PRIMARY KEY,
    school_name VARCHAR(100),
    rating INT
);

-- Property schools link table
CREATE TABLE property_schools (
    property_id INT,
    school_id INT,
    PRIMARY KEY (property_id, school_id),
    FOREIGN KEY (property_id) REFERENCES property(property_id),
    FOREIGN KEY (school_id) REFERENCES schools(school_id)
);

-- Property contract information table
CREATE TABLE contracts (
    contract_id INT PRIMARY KEY,
    property_id INT,
    client_id INT,
    start_date DATE,
    end_date DATE,
    contract_type VARCHAR(20),
    contract_status VARCHAR(20),
    selling_price DECIMAL(15, 2),
    renting_price DECIMAL(15, 2),
    FOREIGN KEY (property_id) REFERENCES property(property_id),
    FOREIGN KEY (client_id) REFERENCES client(client_id)
);

-- Employee and property assignment information table
CREATE TABLE property_assignment (
    property_id INT,
    employee_id INT,
    assignment_date DATE,
    status VARCHAR(100),
    PRIMARY KEY (property_id, employee_id),
    FOREIGN KEY (property_id) REFERENCES property(property_id),
    FOREIGN KEY (employee_id) REFERENCES employee(employee_id)
);

-- Employee management information table
CREATE TABLE manage_employee (
    employee_id INT,
    manager_id INT,
    PRIMARY KEY (employee_id, manager_id),
    FOREIGN KEY (employee_id) REFERENCES employee(employee_id),
    FOREIGN KEY (manager_id) REFERENCES employee(employee_id)
);


-- Open house information table
CREATE TABLE openhouse (
    event_id INT PRIMARY KEY,
    property_id INT,
    employee_id INT,
    event_date DATE,
    start_time TIMESTAMP,
    end_time TIMESTAMP,
    notes VARCHAR(500),
    FOREIGN KEY (property_id) REFERENCES property(property_id),
    FOREIGN KEY (employee_id) REFERENCES employee(employee_id)
);

-- Client appointment information table
CREATE TABLE appointment (
    appointment_id INT PRIMARY KEY,
    event_id INT,
    client_id INT,
    employee_id INT,
    appointment_time TIMESTAMP,
    notes VARCHAR(500),
    FOREIGN KEY (event_id) REFERENCES openhouse(event_id),
    FOREIGN KEY (client_id) REFERENCES client(client_id),
    FOREIGN KEY (employee_id) REFERENCES employee(employee_id)
);

-- Client feedback information table
CREATE TABLE feedback (
    feedback_id INT PRIMARY KEY,
    client_id INT,
    employee_id INT,
    feedback_date DATE,
    comment TEXT,
    FOREIGN KEY (client_id) REFERENCES client(client_id),
    FOREIGN KEY (employee_id) REFERENCES employee(employee_id)
);

-- Property listing information table
CREATE TABLE listing (
    listing_id INT PRIMARY KEY,
    property_id INT,
    listing_date DATE,
    status VARCHAR(20),
    FOREIGN KEY (property_id) REFERENCES property(property_id)
);
'''

stmt = text(stmt)
connection.execute(stmt)

###  Check sample data and structure

In [214]:
from sqlalchemy import create_engine, text
import psycopg2

conn_url = 'postgresql://postgres:123@localhost/5310final_project'
engine = create_engine(conn_url)
connection = engine.connect()

In [215]:
import os
import pandas as pd

# Set the directory where your files are located
data_directory = '/Users/jennyzhong/Desktop/APAN SEMESTER 2/5310 SQL/group project/data'

# Use os.path.join to create full paths to the files
clients_path = os.path.join(data_directory, 'clients.csv')
employees_path = os.path.join(data_directory, 'employees.csv')
home_listings_path = os.path.join(data_directory, 'home_listings.csv')
office_expenses_path = os.path.join(data_directory, 'office_expenses.csv')
transactions_path = os.path.join(data_directory, 'transactions.csv')

# Load the files using the paths
clients = pd.read_csv(clients_path)
employees = pd.read_csv(employees_path)
home_listings = pd.read_csv(home_listings_path)
office_expenses = pd.read_csv(office_expenses_path)
transactions = pd.read_csv(transactions_path)

In [216]:
clients.head()

,Name,Email,Phone Number,Street,State,Zip Code,Client Type,Preferred Home Type,Preferred Number of Bedrooms,Preferred Number of Bathrooms,Preferred Square Footage,Preferred School Rating,Assigned Employee
0,"Melton, Ashley",ashley.melton@example.com,6076274707,549 Nguyen Underpass Suite 698,NY,13309,buyer,condo,5.0,3.0,2775.0,5.0,"Tanner, Sean"
1,"Cooley, Melissa",melissa.cooley@example.com,292-810-9738,44362 Dennis Hill,CT,6205,buyer,single house,1.0,1.0,1812.0,6.0,"Mcguire, Jeanette"
2,"Gibbs, Angela",angela.gibbs@example.com,001-766-553-7400,9515 Joseph Manor Apt. 900,NY,10370,owner,NaN,NaN,NaN,NaN,NaN,"Davis, Ashley"
3,"Gardner, Jasmine",jasmine.gardner@example.com,535.355.1974x252,273 Bernard Ports Apt. 062,NJ,8790,renter,condo,5.0,2.0,2498.0,2.0,"Rios, Mary"
4,"Castro, Charles",charles.castro@example.com,511.384.1001x42377,45976 Stone Squares Apt. 678,NY,14496,owner,NaN,NaN,NaN,NaN,NaN,"Rios, Mary"

In [217]:
employees.head()

,Full Name,Email,Date of Hire,Base Salary,Office Name,Manager Name
0,"Klein, Brian",brian.klein@dreamhomes.nyc,2023-09-19,87173.68,Dream Homes Albany,"Klein, Brian"
1,"Brown, Ryan",ryan.brown@dreamhomes.nyc,2024-02-11,82936.13,Dream Homes Hartford,"Klein, Brian"
2,"Coffey, Patrick",patrick.coffey@dreamhomes.nyc,2023-01-20,36539.21,Dream Homes Bridgeport,"Brown, Ryan"
3,"Watson, Samantha",samantha.watson@dreamhomes.nyc,2023-02-16,80046.93,Dream Homes Albany,"Klein, Brian"
4,"Howard, Katherine",katherine.howard@dreamhomes.nyc,2023-10-12,49379.10,Dream Homes New York,"Brown, Ryan"

In [218]:
home_listings.head()

,Listing ID,Title,Description,Home Type,Bedrooms,Bathrooms,Year Built,Square Footage,Listed Price,Listing Type,Amenities,Street,City,Zip Code,Commute Options,Listing Date,Nearby Schools,Utilities,Owner/Seller Name
0,8585561689,Charming 4-Bedroom Townhouse with parking,This charming 4-bedroom townhouse offers a spa...,Townhouse,4,2,1985,2446,4125,Rent,"['parking', 'patio', 'fireplace', 'doorman', '...",56162 Omar Park,New York,10060,"['Bus 103', 'Bus 101']",2021-05-05,"[{'name': 'Jackson, Smith and Williams', 'rati...",['Verizon'],"Wiggins, Michael"
1,1550678141,Luxurious 3-Bedroom Townhouse with parking,This luxurious 3-bedroom townhouse offers a sp...,Townhouse,3,2,1921,1853,923862,Sale,"['pool', 'gym', 'fireplace', 'patio', 'parking']",466 Dawson Terrace Apt. 858,New York,11033,"['Train A', 'Train B', 'Bus 101']",2022-01-24,"[{'name': 'Wilson Inc', 'rating': 8}, {'name':...","['Optimum', 'Spectrum']","Chavez, Lisa"
2,8476052241,Charming 1-Bedroom Apartment with pool,This charming 1-bedroom apartment offers a spa...,Apartment,1,3,1902,3077,4310,Rent,"['patio', 'gym', 'parking', 'pool', 'doorman']",9026 Chad Valley,Buffalo,10410,['Bus 101'],2021-07-17,"[{'name': 'Weaver-Vargas', 'rating': 0}, {'nam...",['Optimum'],"Bruce, Chris"
3,2107612233,Charming 3-Bedroom Townhouse with parking,This charming 3-bedroom townhouse offers a spa...,Townhouse,3,2,2011,2079,2664,Rent,"['patio', 'gym', 'parking']",827 Santos Stream,Elizabeth,7725,"['Bus 102', 'Train B', 'Bus 103']",2023-09-10,"[{'name': 'Baker-Potter', 'rating': 8}, {'name...","['Spectrum', 'Con Edison', 'National Grid']","Sandoval, Victoria"
4,4929040086,Luxurious 3-Bedroom Condo with pool,This luxurious 3-bedroom condo offers a spacio...,Condo,3,1,1929,1712,781721,Sale,"['patio', 'fireplace', 'pool', 'parking']",3635 Alison Bridge,Stamford,6119,['Train B'],2024-02-15,"[{'name': 'Fletcher, Poole and Alvarez', 'rati...",['Verizon'],"Bryant, Kaitlyn"

In [219]:
office_expenses.head()

,Office Name,Address,State,City,Date,Expense Type,Amount
0,Dream Homes Bridgeport,09080 Stone Hill,CT,Bridgeport,2023-02-26,rent,11641
1,Dream Homes Bridgeport,09080 Stone Hill,CT,Bridgeport,2023-02-26,water,167
2,Dream Homes Bridgeport,09080 Stone Hill,CT,Bridgeport,2023-02-26,electric,261
3,Dream Homes Bridgeport,09080 Stone Hill,CT,Bridgeport,2023-02-26,internet,159
4,Dream Homes Bridgeport,09080 Stone Hill,CT,Bridgeport,2023-03-28,rent,11641

In [220]:
transactions.head()

,Listing ID,Employee Name,Client Name,Date of Transaction,Status,Final Price,Agent Fee Percentage
0,8585561689,"Leon, Patrick","Torres, Robert",2021-05-16,pending rental,NaN,NaN
1,8585561689,"Leon, Patrick","Torres, Robert",2021-06-09,rented,4502.79,100.000000
2,1550678141,"Olson, Andrea","Cox, Megan",2022-01-29,pending sale,NaN,NaN
3,1550678141,"Olson, Andrea","Cox, Megan",2022-02-22,sold,972329.33,4.356721
4,8476052241,"Simpson, Christina","Thompson, Tammy",2021-07-25,pending rental,NaN,NaN

### Data Processing and Load

In [221]:
# An id generating function with seed for consistency
##import random
def generate_random_ids(num, seed=None):
    if seed is not None:
        random.seed(seed)  # Set the seed for reproducibility
    return [random.randint(10000, 99999) for _ in range(num)]

In [222]:
# A date generating function

#import random
#from datetime import datetime, timedelta

def generate_random_date(start_date, end_date):
    delta = end_date - start_date
    random_days = random.randint(0, delta.days)
    return start_date + timedelta(days=random_days)

#### Create client table

In [223]:
# create a dataframe containing columns of clients table only
#from datetime import date
clients['client_id'] = generate_random_ids(len(clients), seed=1706)  # Generate an ID for each client, set seed to consistency
clients['date'] = [generate_random_date(date(2000, 1, 1), date(2024, 4, 18)) for _ in range(len(clients))]

clients_attributes = ['client_id', 'Name', 'Email', 'Phone Number', 'Client Type',
                      'Preferred Home Type', 'Preferred Number of Bedrooms',
                      'Preferred Number of Bathrooms', 'Preferred Square Footage',
                      'Preferred School Rating', 'date']

clients_df = clients[clients_attributes]

In [224]:
# Rename the columns in the DataFrame
column_mapping = {
    'Name': 'name',
    'Email': 'email',
    'Phone Number': 'phone_number',
    'Client Type': 'client_type',
    'Preferred Home Type': 'preferred_home_type',
    'Preferred Number of Bedrooms': 'preferred_number_of_bedrooms',
    'Preferred Number of Bathrooms': 'preferred_number_of_bathrooms',
    'Preferred Square Footage': 'preferred_square_footage',
    'Preferred School Rating': 'preferred_school_rating',
    'date': 'date'
}


clients_df.rename(columns=column_mapping, inplace=True)
clients_df = clients_df.drop_duplicates(subset=['client_id'])

/var/folders/4x/lv34z97s1q37k0h9n8z41l340000gn/T/ipykernel_21452/1756819807.py:16: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  clients_df.rename(columns=column_mapping, inplace=True)

In [70]:
clients_df.head()

,client_id,name,email,phone_number,client_type,preferred_home_type,preferred_number_of_bedrooms,preferred_number_of_bathrooms,preferred_square_footage,preferred_school_rating,date
0,69114,"Melton, Ashley",ashley.melton@example.com,6076274707,buyer,condo,5.0,3.0,2775.0,5.0,2001-11-14
1,87174,"Cooley, Melissa",melissa.cooley@example.com,292-810-9738,buyer,single house,1.0,1.0,1812.0,6.0,2006-09-02
2,71917,"Gibbs, Angela",angela.gibbs@example.com,001-766-553-7400,owner,NaN,NaN,NaN,NaN,NaN,2018-07-20
3,10631,"Gardner, Jasmine",jasmine.gardner@example.com,535.355.1974x252,renter,condo,5.0,2.0,2498.0,2.0,2019-05-09
4,49093,"Castro, Charles",charles.castro@example.com,511.384.1001x42377,owner,NaN,NaN,NaN,NaN,NaN,2017-09-14

In [225]:
clients_df.to_sql(name='client', con=engine, if_exists='append', index=False)

998

#### create client_management table

In [226]:
# create a dataframe containing columns of employees table only
employees['employee_id'] = generate_random_ids(len(employees),seed=1203)
employees_attribute = list(('employee_id','Full Name','Email','Date of Hire','Base Salary'))
employees_df = employees[employees_attribute]

In [227]:
employees_df.head()

,employee_id,Full Name,Email,Date of Hire,Base Salary
0,36770,"Klein, Brian",brian.klein@dreamhomes.nyc,2023-09-19,87173.68
1,57383,"Brown, Ryan",ryan.brown@dreamhomes.nyc,2024-02-11,82936.13
2,34513,"Coffey, Patrick",patrick.coffey@dreamhomes.nyc,2023-01-20,36539.21
3,43800,"Watson, Samantha",samantha.watson@dreamhomes.nyc,2023-02-16,80046.93
4,55308,"Howard, Katherine",katherine.howard@dreamhomes.nyc,2023-10-12,49379.10

In [228]:
employees_df = employees_df.drop_duplicates(subset=['employee_id'])

In [229]:
# Rename the columns in the DataFrame
column_mapping_emp = {
    'Full Name': 'full_name',
    'Email': 'email',
    'Date of Hire':'date_of_hire',
    'Base Salary':'base_salary'
}


employees_df.rename(columns=column_mapping_emp, inplace=True)

In [230]:
employees_df.head()

,employee_id,full_name,email,date_of_hire,base_salary
0,36770,"Klein, Brian",brian.klein@dreamhomes.nyc,2023-09-19,87173.68
1,57383,"Brown, Ryan",ryan.brown@dreamhomes.nyc,2024-02-11,82936.13
2,34513,"Coffey, Patrick",patrick.coffey@dreamhomes.nyc,2023-01-20,36539.21
3,43800,"Watson, Samantha",samantha.watson@dreamhomes.nyc,2023-02-16,80046.93
4,55308,"Howard, Katherine",katherine.howard@dreamhomes.nyc,2023-10-12,49379.10

In [231]:
employees_df.to_sql(name='employee', con=engine, if_exists='append', index=False)

120

#### Create client_management table

In [232]:
client_management_df = pd.merge(clients,
                                employees_df,
                                left_on='Assigned Employee',
                                right_on='full_name',
                                how='left')
client_management_df = client_management_df[['client_id', 'employee_id']]
client_management_df.rename(columns={'client_id': 'client_id', 'employee_id': 'assigned_employee_id'}, inplace=True)
client_management_df.drop_duplicates(subset=['client_id', 'assigned_employee_id'], inplace=True)

client_management_df.head()

   client_id  assigned_employee_id
0      69114                 82603
1      87174                 37634
2      71917                 45954
3      10631                 73139
4      49093                 73139

In [233]:
client_management_df.to_sql(name='client_management', con=engine, if_exists='append', index=False)

1000

#### Create Employee-management table

In [234]:
employee_management_df = pd.merge(employees,
                                  employees,
                                  left_on='Manager Name',
                                  right_on='Full Name',
                                  suffixes=('', '_manager'))
employee_management_df = employee_management_df[['employee_id', 'employee_id_manager']]
employee_management_df.rename(columns={'employee_id': 'employee_id', 'employee_id_manager': 'manager_id'}, inplace=True)
employee_management_df.head()

   employee_id  manager_id
0        36770       36770
1        57383       36770
2        43800       36770
3        36876       36770
4        82648       36770

In [235]:
employee_management_df.to_sql(name='manage_employee', con=engine, if_exists='append', index=False)

120

#### create office and expenses table

In [236]:
unique_offices = office_expenses.drop_duplicates(subset=['Office Name', 'Address', 'State', 'City'])
unique_offices['office_id'] = generate_random_ids(len(unique_offices))

# Merge unique_offices back to the original DataFrame to map office_id correctly
office_expenses = office_expenses.merge(unique_offices[['Office Name', 'Address', 'State', 'City', 'office_id']],
                                        on=['Office Name', 'Address', 'State', 'City'], how='left')

# Create Expenses DataFrame with unique expense IDs
office_expenses['expense_id'] = generate_random_ids(len(office_expenses))
expenses_df = office_expenses[['expense_id', 'office_id', 'Date', 'Expense Type', 'Amount']]

# Create Office DataFrame
office_df = unique_offices[['office_id', 'Office Name', 'Address', 'State', 'City']]

# Display the DataFrames
print("Office DataFrame:")
print(office_df)
print("\nExpenses DataFrame:")
print(expenses_df)

Office DataFrame:
      office_id              Office Name                          Address  \
0         74043   Dream Homes Bridgeport                 09080 Stone Hill
56        41156       Dream Homes Albany              93021 Charles Rapid
108       90651   Dream Homes Bridgeport                 9121 Kevin Alley
184       15428   Dream Homes Bridgeport       45519 Owens Ramp Suite 211
244       26697       Dream Homes Albany         175 Cheryl Cove Apt. 694
320       87177  Dream Homes Jersey City                 1783 Laura Lakes
436       73399     Dream Homes Syracuse      207 Morgan Courts Suite 131
616       73616   Dream Homes Bridgeport      0503 Rachel Manor Suite 791
640       51602     Dream Homes Hartford  78301 Daugherty Brooks Apt. 072
832       69872       Dream Homes Albany     5294 Sandra Spring Suite 124
844       88234     Dream Homes Paterson         65434 Christopher Street
1016      51740   Dream Homes Bridgeport       5228 Kyle Rapids Suite 260
1152      80771     Dream Homes Syracuse         921 Christopher Turnpike
1316      66839       Dream Homes Newark               3824 Burton Meadow
1384      75884    Dream Homes Rochester    73776 Wilson Station Apt. 201
1464      91784       Dream Homes Albany                  6200 Kelly View
1516      46009       Dream Homes Albany                 605 Avila Cliffs
1644      76781     Dream Homes Stamford                  865 Kim Village
1796      78742     Dream Homes Hartford            87735 Heather Station
1916      80052      Dream Homes Trenton          5703 Katherine Crossing
1944      30269     Dream Homes Syracuse         249 Long Light Suite 896
2032      64707     Dream Homes Paterson     2570 Edward Island Suite 292
2092      89256   Dream Homes Bridgeport       732 Sean Terrace Suite 820
2156      79843    Dream Homes Waterbury                  9705 Gary Roads
2164      52338      Dream Homes Trenton       7706 Gina Summit Suite 417
2212      40322       Dream Homes Newark                   801 Moore Spur
2264      89135     Dream Homes New York       34968 Miller Neck Apt. 364
2336      95620    Dream Homes New Haven              5709 Nicholas Drive
2372      83915       Dream Homes Newark               90021 Jerry Forest
2464      24623      Dream Homes Trenton               6087 Romero Skyway
2660      68279     Dream Homes Hartford   36136 Wood Stravenue Suite 798
2676      49428      Dream Homes Buffalo      40298 Perez Drive Suite 835

     State         City
0       CT   Bridgeport
56      NY       Albany
108     CT   Bridgeport
184     CT   Bridgeport
244     NY       Albany
320     NJ  Jersey City
436     NY     Syracuse
616     CT   Bridgeport
640     CT     Hartford
832     NY       Albany
844     NJ     Paterson
1016    CT   Bridgeport
1152    NY     Syracuse
1316    NJ       Newark
1384    NY    Rochester
1464    NY       Albany
1516    NY       Albany
1644    CT     Stamford
1796    CT     Hartford
1916    NJ      Trenton
1944    NY     Syracuse
2032    NJ     Paterson
2092    CT   Bridgeport
2156    CT    Waterbury
2164    NJ      Trenton
2212    NJ       Newark
2264    NY     New York
2336    CT    New Haven
2372    NJ       Newark
2464    NJ      Trenton
2660    CT     Hartford
2676    NY      Buffalo

Expenses DataFrame:
      expense_id  office_id        Date Expense Type  Amount
0          21021      74043  2023-02-26         rent   11641
1          22710      74043  2023-02-26        water     167
2          94255      74043  2023-02-26     electric     261
3          47096      74043  2023-02-26     internet     159
4          29705      74043  2023-03-28         rent   11641
...          ...        ...         ...          ...     ...
2799       10557      49428  2024-02-22     internet     119
2800       70096      49428  2024-03-23         rent   21922
2801       69865      49428  2024-03-23        water     205
2802       21438      49428  2024-03-23     electric     356
2803       59162      49428  2024-03-23     internet     129

[2804 rows x 5 columns]

/var/folders/4x/lv34z97s1q37k0h9n8z41l340000gn/T/ipykernel_21452/1975472283.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  unique_offices['office_id'] = generate_random_ids(len(unique_offices))

In [237]:
# Rename the columns in the DataFrame
column_mapping_office = {
    'Office Name': 'office_name',
    'Address': 'address',
    'State': 'state',
    'City': 'city'
}


office_df.rename(columns=column_mapping_office, inplace=True)

office_df.head()

/var/folders/4x/lv34z97s1q37k0h9n8z41l340000gn/T/ipykernel_21452/199755331.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  office_df.rename(columns=column_mapping_office, inplace=True)

,office_id,office_name,address,state,city
0,74043,Dream Homes Bridgeport,09080 Stone Hill,CT,Bridgeport
56,41156,Dream Homes Albany,93021 Charles Rapid,NY,Albany
108,90651,Dream Homes Bridgeport,9121 Kevin Alley,CT,Bridgeport
184,15428,Dream Homes Bridgeport,45519 Owens Ramp Suite 211,CT,Bridgeport
244,26697,Dream Homes Albany,175 Cheryl Cove Apt. 694,NY,Albany

In [238]:
office_df.to_sql(name='office', con=engine, if_exists='append', index=False)

32

In [239]:
# Rename the columns in the DataFrame
column_mapping_exp = {
    'Date': 'date',
    'Expense Type': 'expense_type',
    'Amount': 'amount'
}


expenses_df.rename(columns=column_mapping_exp, inplace=True)
expenses_df.head()

/var/folders/4x/lv34z97s1q37k0h9n8z41l340000gn/T/ipykernel_21452/1705601650.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  expenses_df.rename(columns=column_mapping_exp, inplace=True)

   expense_id  office_id        date expense_type  amount
0       21021      74043  2023-02-26         rent   11641
1       22710      74043  2023-02-26        water     167
2       94255      74043  2023-02-26     electric     261
3       47096      74043  2023-02-26     internet     159
4       29705      74043  2023-03-28         rent   11641

In [240]:
expenses_df.drop_duplicates(subset=['expense_id'], inplace=True)

/var/folders/4x/lv34z97s1q37k0h9n8z41l340000gn/T/ipykernel_21452/2464969655.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  expenses_df.drop_duplicates(subset=['expense_id'], inplace=True)

In [241]:
expenses_df.to_sql(name='expenses', con=engine, if_exists='append', index=False)

761

#### Property table

In [242]:
# create a dataframe containing columns of property table only
#'property_id', 'property_type','listing_date', 'title', 'street', 'city', 'zipcode', 'num_bedrooms', 'num_bathrooms', 'square_footage', 'year_built', 'listing_price', 'owner', 'description'
property_attribute = list(('Listing Type','Listing Date','Title','Street','City','Zip Code','Bedrooms','Bathrooms','Square Footage','Year Built','Listed Price','Owner/Seller Name', 'Description'))
property_df = home_listings[property_attribute]
property_df['property_id'] = generate_random_ids(len(property_df),seed=123)
property_df.drop_duplicates(subset='property_id', inplace=True)


property_df.head()

/var/folders/4x/lv34z97s1q37k0h9n8z41l340000gn/T/ipykernel_21452/1779810883.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  property_df['property_id'] = generate_random_ids(len(property_df),seed=123)
/var/folders/4x/lv34z97s1q37k0h9n8z41l340000gn/T/ipykernel_21452/1779810883.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  property_df.drop_duplicates(subset='property_id', inplace=True)

,Listing Type,Listing Date,Title,Street,City,Zip Code,Bedrooms,Bathrooms,Square Footage,Year Built,Listed Price,Owner/Seller Name,Description,property_id
0,Rent,2021-05-05,Charming 4-Bedroom Townhouse with parking,56162 Omar Park,New York,10060,4,2,2446,1985,4125,"Wiggins, Michael",This charming 4-bedroom townhouse offers a spa...,16863
1,Sale,2022-01-24,Luxurious 3-Bedroom Townhouse with parking,466 Dawson Terrace Apt. 858,New York,11033,3,2,1853,1921,923862,"Chavez, Lisa",This luxurious 3-bedroom townhouse offers a sp...,45084
2,Rent,2021-07-17,Charming 1-Bedroom Apartment with pool,9026 Chad Valley,Buffalo,10410,1,3,3077,1902,4310,"Bruce, Chris",This charming 1-bedroom apartment offers a spa...,21427
3,Rent,2023-09-10,Charming 3-Bedroom Townhouse with parking,827 Santos Stream,Elizabeth,7725,3,2,2079,2011,2664,"Sandoval, Victoria",This charming 3-bedroom townhouse offers a spa...,63377
4,Sale,2024-02-15,Luxurious 3-Bedroom Condo with pool,3635 Alison Bridge,Stamford,6119,3,1,1712,1929,781721,"Bryant, Kaitlyn",This luxurious 3-bedroom condo offers a spacio...,44937

In [243]:


column_mapping = {
    'Owner/Seller Name': 'owner_seller_name',
    'Title': 'title',
    'Street': 'street',
    'City': 'city',
    'Zip Code': 'zip_code',
    'Bedrooms': 'bedrooms',
    'Bathrooms': 'bathrooms',
    'Square Footage': 'square_footage',
    'Year Built': 'year_built',
    'Listed Price': 'listed_price',
    'Description': 'description',
    'Listing Type': 'listing_type',
    'Listing Date':'listing_date'
}

property_df.rename(columns=column_mapping, inplace=True)

property_df.head()

/var/folders/4x/lv34z97s1q37k0h9n8z41l340000gn/T/ipykernel_21452/3891296496.py:17: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  property_df.rename(columns=column_mapping, inplace=True)

,listing_type,listing_date,title,street,city,zip_code,bedrooms,bathrooms,square_footage,year_built,listed_price,owner_seller_name,description,property_id
0,Rent,2021-05-05,Charming 4-Bedroom Townhouse with parking,56162 Omar Park,New York,10060,4,2,2446,1985,4125,"Wiggins, Michael",This charming 4-bedroom townhouse offers a spa...,16863
1,Sale,2022-01-24,Luxurious 3-Bedroom Townhouse with parking,466 Dawson Terrace Apt. 858,New York,11033,3,2,1853,1921,923862,"Chavez, Lisa",This luxurious 3-bedroom townhouse offers a sp...,45084
2,Rent,2021-07-17,Charming 1-Bedroom Apartment with pool,9026 Chad Valley,Buffalo,10410,1,3,3077,1902,4310,"Bruce, Chris",This charming 1-bedroom apartment offers a spa...,21427
3,Rent,2023-09-10,Charming 3-Bedroom Townhouse with parking,827 Santos Stream,Elizabeth,7725,3,2,2079,2011,2664,"Sandoval, Victoria",This charming 3-bedroom townhouse offers a spa...,63377
4,Sale,2024-02-15,Luxurious 3-Bedroom Condo with pool,3635 Alison Bridge,Stamford,6119,3,1,1712,1929,781721,"Bryant, Kaitlyn",This luxurious 3-bedroom condo offers a spacio...,44937

In [244]:
property_df.to_sql(name='property', con=engine, if_exists='append', index=False)

997

#### Property feature table

In [245]:

feature_ids = generate_random_ids(15, seed=900)
feature_names =  ["Electric", "Gas", "Water", "Sewer", "Garbage", "Internet",
                 "Cable TV", "Security System", "Solar Panels", "HVAC", 
                 "Landscaping Services", "Pool Service", "Snow Removal", 
                 "Recycling Services", "Fire Prevention"]
property_features = pd.DataFrame({
    'feature_id': feature_ids,
    'feature_name': feature_names
})
property_features.head()

   feature_id feature_name
0       91800     Electric
1       39926          Gas
2       59116        Water
3       22503        Sewer
4       96597      Garbage

In [246]:
property_features.to_sql(name='property_features', con=engine, if_exists='append', index=False)

15

#### Property feature link

In [247]:
#Create Utilities df
utility_ids = generate_random_ids(15, seed=900)
# Predefined utility names
utility_names = ["Electric", "Gas", "Water", "Sewer", "Garbage", "Internet",
                 "Cable TV", "Security System", "Solar Panels", "HVAC", 
                 "Landscaping Services", "Pool Service", "Snow Removal", 
                 "Recycling Services", "Fire Prevention"]

# Ensure we have a unique utility name for each ID
utility_names = utility_names[:len(utility_ids)]

# Create the utilities DataFrame
utilities_df = pd.DataFrame({
    'utility_id': utility_ids,
    'utility_name': utility_names
})

# Display utilities to verify
utilities_df.head()



##Create utility property df
property_ids = property_df['property_id'].tolist()

# Create property_utilities link table
# Each property will be linked to one or more utilities randomly
property_utilities_data = []
for property_id in property_ids:
    selected_utilities = random.sample(utility_ids, k=random.randint(1, 3))  # Each property gets 1-3 utilities
    for utility_id in selected_utilities:
        property_utilities_data.append({
            'property_id': property_id,
            'utility_id': utility_id
        })

# Create the property_utilities DataFrame
property_utilities_df = pd.DataFrame(property_utilities_data)

#rename
property_feature_link_df = property_utilities_df.copy()
property_feature_link_df.columns = ['property_id', 'feature_id']

# Display the updated DataFrame
property_feature_link_df.head()

   property_id  feature_id
0        16863       79570
1        16863       41999
2        45084       22503
3        45084       31351
4        45084       39926

In [248]:
property_feature_link_df.to_sql(name='property_feature_link', con=engine, if_exists='append', index=False)

971

#### Extract the transactions table

In [249]:
transactions.head()

,Listing ID,Employee Name,Client Name,Date of Transaction,Status,Final Price,Agent Fee Percentage
0,8585561689,"Leon, Patrick","Torres, Robert",2021-05-16,pending rental,NaN,NaN
1,8585561689,"Leon, Patrick","Torres, Robert",2021-06-09,rented,4502.79,100.000000
2,1550678141,"Olson, Andrea","Cox, Megan",2022-01-29,pending sale,NaN,NaN
3,1550678141,"Olson, Andrea","Cox, Megan",2022-02-22,sold,972329.33,4.356721
4,8476052241,"Simpson, Christina","Thompson, Tammy",2021-07-25,pending rental,NaN,NaN

In [250]:
#replace Employee name with employee_id
transactions['transaction_id'] = generate_random_ids(len(transactions),seed=300)
transactions['Listing ID'] = generate_random_ids(len(transactions),seed=123)
transactions1 = pd.merge(transactions, employees_df, left_on='Employee Name', right_on='full_name', how='left')
transactions1.drop(['Employee Name', 'full_name'], axis=1, inplace=True)
transactions1.head()

,Listing ID,Client Name,Date of Transaction,Status,Final Price,Agent Fee Percentage,transaction_id,employee_id,email,date_of_hire,base_salary
0,16863,"Torres, Robert",2021-05-16,pending rental,NaN,NaN,88341,38456,patrick.leon@dreamhomes.nyc,2023-09-01,58839.48
1,45084,"Torres, Robert",2021-06-09,rented,4502.79,100.000000,56719,38456,patrick.leon@dreamhomes.nyc,2023-09-01,58839.48
2,21427,"Cox, Megan",2022-01-29,pending sale,NaN,NaN,55181,51878,andrea.olson@dreamhomes.nyc,2023-09-28,31438.68
3,63377,"Cox, Megan",2022-02-22,sold,972329.33,4.356721,10195,51878,andrea.olson@dreamhomes.nyc,2023-09-28,31438.68
4,44937,"Thompson, Tammy",2021-07-25,pending rental,NaN,NaN,74292,93126,christina.simpson@dreamhomes.nyc,2022-12-06,72070.55

In [251]:
transactions_attribute = list(('transaction_id','Listing ID','employee_id','Date of Transaction','Status','Final Price','Agent Fee Percentage'))
transactions_df = transactions1[transactions_attribute]
transactions_df

,transaction_id,Listing ID,employee_id,Date of Transaction,Status,Final Price,Agent Fee Percentage
0,88341,16863,38456,2021-05-16,pending rental,NaN,NaN
1,56719,45084,38456,2021-06-09,rented,4502.79,100.000000
2,55181,21427,51878,2022-01-29,pending sale,NaN,NaN
3,10195,63377,51878,2022-02-22,sold,972329.33,4.356721
4,74292,44937,93126,2021-07-25,pending rental,NaN,NaN
...,...,...,...,...,...,...,...
1995,81372,14738,66451,2022-11-14,relisted,NaN,NaN
1996,66937,80430,37634,2023-01-19,pending rental,NaN,NaN
1997,39169,40824,37634,2023-02-15,rented,4155.69,100.000000
1998,17142,72676,58478,2023-04-17,pending rental,NaN,NaN
1999,60113,59958,58478,2023-05-09,rented,3096.90,100.000000

In [252]:
transactions_df.loc[0:999,'client_id'] = clients[0:999]['client_id']
transactions_df.loc[1000:1999,'client_id'] = transactions_df.loc[0:999,'client_id']

/var/folders/4x/lv34z97s1q37k0h9n8z41l340000gn/T/ipykernel_21452/3352779542.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  transactions_df.loc[0:999,'client_id'] = clients[0:999]['client_id']

In [253]:
transactions_df.rename(columns={'Listing ID': 'property_id', 'Date of Transaction': 'date_of_transaction','Status':'status','Final Price':'final_price','Agent Fee Percentage':'agent_fee_percentage'}, inplace=True)
transactions_df.drop_duplicates(subset='transaction_id', inplace=True)

transactions_df.head()

/var/folders/4x/lv34z97s1q37k0h9n8z41l340000gn/T/ipykernel_21452/3672472742.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  transactions_df.rename(columns={'Listing ID': 'property_id', 'Date of Transaction': 'date_of_transaction','Status':'status','Final Price':'final_price','Agent Fee Percentage':'agent_fee_percentage'}, inplace=True)
/var/folders/4x/lv34z97s1q37k0h9n8z41l340000gn/T/ipykernel_21452/3672472742.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  transactions_df.drop_duplicates(subset='transaction_id', inplace=True)

,transaction_id,property_id,employee_id,date_of_transaction,status,final_price,agent_fee_percentage,client_id
0,88341,16863,38456,2021-05-16,pending rental,NaN,NaN,69114.0
1,56719,45084,38456,2021-06-09,rented,4502.79,100.000000,87174.0
2,55181,21427,51878,2022-01-29,pending sale,NaN,NaN,71917.0
3,10195,63377,51878,2022-02-22,sold,972329.33,4.356721,10631.0
4,74292,44937,93126,2021-07-25,pending rental,NaN,NaN,49093.0

In [254]:
existing_property_ids = pd.read_sql_table('property', con=engine)['property_id'].tolist()
valid_transactions = transactions_df[transactions_df['property_id'].isin(existing_property_ids)]
valid_transactions.to_sql(name='transaction', con=engine, if_exists='append', index=False)

3

Create sample data for feedback table

In [255]:
# Set the seed for the random generator
random.seed(250)

first_10_clients = clients.head(10)
employee_name_id_map = dict(zip(employees['Full Name'], employees['employee_id']))
first_10_clients['employee_id'] = first_10_clients['Assigned Employee'].map(employee_name_id_map)

feedback_ids = generate_random_ids(10, seed=250)
feedback_dates = [generate_random_date(date(2000, 1, 1), date(2024, 4, 18)) for _ in range(10)]
comments = [
    "Very helpful and informative.",
    "Provided excellent service and support.",
    "Could improve in communication.",
    "Went above and beyond to assist.",
    "Pleasant and professional throughout the process.",
    "Took the time to answer all my questions.",
    "Follow-up was prompt and helpful.",
    "Made the buying process straightforward.",
    "Very patient and understanding.",
    "Knowledgeable and efficient."
]

# Create the feedback DataFrame
feedback_df = pd.DataFrame({
    'feedback_id': feedback_ids,
    'client_id': first_10_clients['client_id'].tolist(),
    'employee_id': first_10_clients['employee_id'].tolist(),
    'feedback_date': feedback_dates,
    'comment': comments
})


feedback_df.head(10)

/var/folders/4x/lv34z97s1q37k0h9n8z41l340000gn/T/ipykernel_21452/1576643978.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  first_10_clients['employee_id'] = first_10_clients['Assigned Employee'].map(employee_name_id_map)

,feedback_id,client_id,employee_id,feedback_date,comment
0,60797,69114,82603,2016-10-15,Very helpful and informative.
1,62668,87174,37634,2018-05-06,Provided excellent service and support.
2,30593,71917,45954,2011-10-29,Could improve in communication.
3,83681,10631,73139,2018-12-04,Went above and beyond to assist.
4,98007,49093,73139,2020-09-06,Pleasant and professional throughout the process.
5,18950,52213,52222,2013-11-27,Took the time to answer all my questions.
6,15128,71421,92077,2007-02-16,Follow-up was prompt and helpful.
7,83302,68825,38246,2007-10-24,Made the buying process straightforward.
8,41577,65966,26913,2019-02-02,Very patient and understanding.
9,31788,66512,14527,2008-07-05,Knowledgeable and efficient.

In [256]:
feedback_df.to_sql('feedback',con=engine, index=False, if_exists='replace')

10

Create Sample data for openhouse table

In [257]:
random.seed(250)
# Generate random event_ids and property_ids
event_ids = generate_random_ids(10, seed=2020)
property_ids = generate_random_ids(10,seed=123)
employee_ids = employees['employee_id'].head(10).tolist()

# Generate random event_dates, start_times, and end_times within a specific timeframe
event_dates = [(datetime.now() + timedelta(days=i)).strftime('%Y-%m-%d') for i in range(10)]
start_times = [(datetime.now() + timedelta(days=i, hours=10)).strftime('%Y-%m-%d %H:%M:%S') for i in range(10)]
end_times = [(datetime.now() + timedelta(days=i, hours=14)).strftime('%Y-%m-%d %H:%M:%S') for i in range(10)]

# Random notes for the events
notes = [
    "Newly renovated with a stunning view.",
    "Featuring a spacious backyard and modern amenities.",
    "Luxurious property in a prime location.",
    "Ideal home for those who love to entertain.",
    "Quaint and charming with historic details preserved.",
    "Stylish townhouse with eco-friendly features.",
    "Award-winning design and architecture.",
    "Family-friendly neighborhood with lots of green space.",
    "Perfect blend of comfort and convenience.",
    "Sophisticated urban living with rooftop terrace."
]

# Create the openhouse DataFrame
openhouse_df = pd.DataFrame({
    'event_id': event_ids,
    'property_id': property_ids,
    'employee_id': employee_ids,
    'event_date': event_dates,
    'start_time': start_times,
    'end_time': end_times,
    'notes': notes
})

openhouse_df.head(10)

,event_id,property_id,employee_id,event_date,start_time,end_time,notes
0,91221,16863,36770,2024-04-24,2024-04-24 23:01:00,2024-04-25 03:01:00,Newly renovated with a stunning view.
1,91197,45084,57383,2024-04-25,2024-04-25 23:01:00,2024-04-26 03:01:00,Featuring a spacious backyard and modern ameni...
2,32875,21427,34513,2024-04-26,2024-04-26 23:01:00,2024-04-27 03:01:00,Luxurious property in a prime location.
3,97870,63377,43800,2024-04-27,2024-04-27 23:01:00,2024-04-28 03:01:00,Ideal home for those who love to entertain.
4,70426,44937,55308,2024-04-28,2024-04-28 23:01:00,2024-04-29 03:01:00,Quaint and charming with historic details pres...
5,67997,24116,73460,2024-04-29,2024-04-29 23:01:00,2024-04-30 03:01:00,Stylish townhouse with eco-friendly features.
6,72149,15000,83441,2024-04-30,2024-04-30 23:01:00,2024-05-01 03:01:00,Award-winning design and architecture.
7,58318,59692,64750,2024-05-01,2024-05-01 23:01:00,2024-05-02 03:01:00,Family-friendly neighborhood with lots of gree...
8,64960,80281,85770,2024-05-02,2024-05-02 23:01:00,2024-05-03 03:01:00,Perfect blend of comfort and convenience.
9,81170,83704,92077,2024-05-03,2024-05-03 23:01:00,2024-05-04 03:01:00,Sophisticated urban living with rooftop terrace.

In [258]:
openhouse_df.to_sql(name='openhouse', con=engine, if_exists='append', index=False)

10

Continuing creating sample data...

In [259]:
# Sample data for the appointment table
# Generate random appointment IDs
random.seed(500)  # Seed for reproducibility
appointment_ids = generate_random_ids(10, seed=500)

# Extract first 10 event_ids and employee_ids from openhouse_df
event_ids = openhouse_df['event_id'].head(10).tolist()
employee_ids = openhouse_df['employee_id'].head(10).tolist()
# Extract matching client_ids from client_management_df or clients DataFrame
client_ids = clients['client_id'].head(10).tolist()  
appointment_times = [(datetime.now() + timedelta(days=i, hours=11, minutes=random.randint(0, 59))).strftime('%Y-%m-%d %H:%M:%S') for i in range(10)]
# Predefined notes for the appointments
notes = [
    "Discussion on financing options",
    "Detailed property tour and features",
    "Negotiation meeting with property owner",
    "Overview of historical details and preservation",
    "Discussion on modern architecture and design",
    "Review of community amenities and services",
    "Consultation on mortgage and legal aspects",
    "Private viewing and inspection arrangements",
    "Customization options and upgrades",
    "Energy efficiency and sustainability features"
]

# Create the appointment DataFrame
appointment_df = pd.DataFrame({
    'appointment_id': appointment_ids,
    'event_id': event_ids,
    'client_id': client_ids,
    'employee_id': employee_ids,
    'appointment_time': appointment_times,
    'notes': notes
})

appointment_df.head(10)

,appointment_id,event_id,client_id,employee_id,appointment_time,notes
0,70503,91221,69114,36770,2024-04-25 00:52:02,Discussion on financing options
1,79038,91197,87174,57383,2024-04-26 00:37:02,Detailed property tour and features
2,85798,32875,71917,34513,2024-04-27 00:48:02,Negotiation meeting with property owner
3,71411,97870,10631,43800,2024-04-28 00:51:02,Overview of historical details and preservation
4,43506,70426,49093,55308,2024-04-29 00:06:02,Discussion on modern architecture and design
5,93296,67997,52213,73460,2024-04-30 00:02:02,Review of community amenities and services
6,59278,72149,71421,83441,2024-05-01 00:13:02,Consultation on mortgage and legal aspects
7,37897,58318,68825,64750,2024-05-02 00:22:02,Private viewing and inspection arrangements
8,24156,64960,65966,85770,2024-05-03 00:15:02,Customization options and upgrades
9,54476,81170,66512,92077,2024-05-04 00:26:02,Energy efficiency and sustainability features

In [260]:
appointment_df.to_sql(name='appointment', con=engine, if_exists='append', index=False)

10

In [261]:
# Sample data for the contracts table
random.seed(250)

contract_ids = generate_random_ids(10, seed=700)
property_ids = openhouse_df['property_id'].head(10).tolist()
client_ids = clients['client_id'].head(10).tolist()

# Generate random start and end dates
start_dates = [(datetime.now() + timedelta(days=i * 30)).strftime('%Y-%m-%d') for i in range(10)]
end_dates = [(datetime.strptime(start, '%Y-%m-%d') + timedelta(days=365)).strftime('%Y-%m-%d') for start in start_dates]

# Define random contract types and statuses
contract_types = random.choices(['rent', 'sell', 'buy'], k=10)
contract_statuses = random.choices(['active', 'pending', 'completed', 'cancelled'], k=10)

# Generate random selling and renting prices
selling_prices = [random.choice([0, 300000, 450000, 500000, 350000]) if ct != 'rent' else 0 for ct in contract_types]
renting_prices = [random.choice([1500, 2000, 2500, 0]) if ct == 'rent' else 0 for ct in contract_types]

# Create the contracts DataFrame
contracts_df = pd.DataFrame({
    'contract_id': contract_ids,
    'property_id': property_ids,
    'client_id': client_ids,
    'start_date': start_dates,
    'end_date': end_dates,
    'contract_type': contract_types,
    'contract_status': contract_statuses,
    'selling_price': selling_prices,
    'renting_price': renting_prices
})

contracts_df.head(10)

,contract_id,property_id,client_id,start_date,end_date,contract_type,contract_status,selling_price,renting_price
0,31786,16863,69114,2024-04-24,2025-04-24,rent,pending,0,0
1,35142,45084,87174,2024-05-24,2025-05-24,rent,active,0,1500
2,68745,21427,71917,2024-06-23,2025-06-23,rent,completed,0,0
3,38173,63377,10631,2024-07-23,2025-07-23,sell,active,350000,0
4,79582,44937,49093,2024-08-22,2025-08-22,buy,completed,0,0
5,90563,24116,52213,2024-09-21,2025-09-21,rent,cancelled,0,1500
6,52442,15000,71421,2024-10-21,2025-10-21,sell,cancelled,300000,0
7,10703,59692,68825,2024-11-20,2025-11-20,sell,completed,350000,0
8,89537,80281,65966,2024-12-20,2025-12-20,rent,pending,0,0
9,82265,83704,66512,2025-01-19,2026-01-19,rent,pending,0,0

In [262]:
contracts_df.to_sql(name='contracts', con=engine, if_exists='append', index=False)

10

#### Listing table

In [263]:
listing_ids = generate_random_ids(10, seed=360)
property_ids = openhouse_df['property_id'].head(10).tolist()
statuses = ['active', 'pending', 'sold', 'rented', 'withdrawn']
# Generate random listing dates and statuses
listing_dates = [date.today() - timedelta(days=random.randint(1, 365)) for _ in range(10)]
listing_statuses = [random.choice(statuses) for _ in range(10)]

# Create the listing DataFrame
listing_df = pd.DataFrame({
    'listing_id': listing_ids,
    'property_id': property_ids,
    'listing_date': listing_dates,
    'status': listing_statuses
})

listing_df.head()

   listing_id  property_id listing_date   status
0       40225        16863   2024-03-14   rented
1       50177        45084   2023-12-19   rented
2       41812        21427   2024-03-21     sold
3       96692        63377   2024-02-23  pending
4       21170        44937   2023-11-09     sold

In [264]:
listing_df.to_sql(name='listing', con=engine, if_exists='append', index=False)

10

#### property_assignment table

In [265]:
property_ids = generate_random_ids(10,seed=123)
employee_ids=employees_df['employee_id'].head(10).tolist()
assignment_date = [date.today() - timedelta(days=random.randint(1, 365)) for _ in range(10)]
status_values = ['Assigned', 'Active', 'Pending', 'On Hold', 'Closed', 'Canceled', 'Reassigned']
property_statuses = [random.choice(status_values) for _ in range(10)]

# Create the property assignment DataFrame
property_assignment = pd.DataFrame({
    'property_id': property_ids,
    'employee_id': employee_ids,
    'assignment_date': assignment_date,
    'status': property_statuses
})

property_assignment.head()

   property_id  employee_id assignment_date      status
0        16863        36770      2023-11-05      Active
1        45084        57383      2023-11-01    Assigned
2        21427        34513      2024-03-28     On Hold
3        63377        43800      2024-02-02  Reassigned
4        44937        55308      2024-02-14    Assigned

In [266]:
property_assignment.to_sql(name='property_assignment', con=engine, if_exists='append', index=False)

10

In [270]:
import pandas as pd
import random
import ast  # Import the ast module to safely convert string representations of lists/dicts

# Function to generate random IDs
def generate_random_ids(num, seed=None):
    if seed is not None:
        random.seed(seed)  # Optional: for reproducibility
    return [random.randint(1000, 9999) for _ in range(num)]


# Parse the 'Nearby Schools' column data
if 'Nearby Schools' in home_listings.columns:
    # Extract unique school names and ratings
    school_entries = set()
    for schools_string in home_listings['Nearby Schools']:
        # Safely convert the string to a list of dictionaries
        schools_list = ast.literal_eval(schools_string)
        for school_dict in schools_list:
            school_name = school_dict['name']
            rating = school_dict['rating']
            school_entries.add((school_name, rating))

    # Create DataFrame from the set of entries
    schools_df = pd.DataFrame(list(school_entries), columns=['school_name', 'rating'])
    schools_df['school_id'] = generate_random_ids(len(school_entries), seed=1000)  # Assign random school IDs

    # Assuming property_df is ready and has 'Listing ID'
    property_ids = property_df['property_id'].tolist()

    # Create property_schools link table
    property_schools_data = []
    for property_id in property_ids:
        selected_schools = schools_df.sample(n=random.randint(1, 3))  # Each property gets 1-3 schools linked
        for _, school_row in selected_schools.iterrows():
            property_schools_data.append({
                'property_id': property_id,
                'school_id': school_row['school_id']
            })

    # DataFrame for property to schools linkage
    property_schools_df = pd.DataFrame(property_schools_data)

    # Display results
    print(schools_df.head())
    print(property_schools_df.head())

else:
    print("The 'Nearby Schools' column is missing or incorrectly named in the home_listings DataFrame.")

             school_name  rating  school_id
0              Lee-Black      10       8028
1  Dixon, Horn and Baker       9       2624
2            Day-Hickman      10       7448
3       Espinoza-Kennedy       8       6783
4            Scott Group       0       2031
   property_id  school_id
0        16863       2100
1        16863       7548
2        45084       1700
3        45084       1967
4        21427       4787

#### schools table

In [271]:
schools_df.drop_duplicates(subset=['school_id'], inplace=True)

schools_df.head()

             school_name  rating  school_id
0              Lee-Black      10       8028
1  Dixon, Horn and Baker       9       2624
2            Day-Hickman      10       7448
3       Espinoza-Kennedy       8       6783
4            Scott Group       0       2031

In [272]:
schools_df.to_sql(name='schools', con=engine, if_exists='append', index=False)

780

#### property_schools table

In [273]:
property_schools_df.to_sql(name='property_schools', con=engine, if_exists='append', index=False)

943

In [274]:
property_schools_df.head()

   property_id  school_id
0        16863       2100
1        16863       7548
2        45084       1700
3        45084       1967
4        21427       4787

### Connection and Schema